tutorials/incompressible/pimpleFoam/LES/surfaceMountedCube/fullCase/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
//        type            timeVaryingMappedFixedValue;
//        offset          (0 0 0);
//        setAverage      off;
        type            turbulentDFSEMInlet;
        delta           1;
        nCellPerEddy    3;
        U
        {
            type        mappedFile;
            mapMethod   nearest;
        }
        R
        {
            type        mappedFile;
            mapMethod   nearest;
        }
        L
        {
            type        mappedFile;
            mapMethod   nearest;
        }
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    sides
    {
        type            slip;
    }

    "(cube|topAndBottom)"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
